ABigBright/qemu_stm32_1/hw/xtensa/esp32_picsimlab.c
        esp32_soc_add_periph_device(sys_mem, &s->i2c[i], i2c_base[i]);

        sysbus_connect_irq(SYS_BUS_DEVICE(&s->i2c[i]), 0,
                           qdev_get_gpio_in(intmatrix_dev, ETS_I2C_EXT0_INTR_SOURCE + i));
    }

    qdev_realize(DEVICE(&s->rng), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device(sys_mem, &s->rng, ESP32_RNG_BASE);

    qdev_realize(DEVICE(&s->efuse), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device(sys_mem, &s->efuse, DR_REG_EFUSE_BASE);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->efuse), 0,
                       qdev_get_gpio_in(intmatrix_dev, ETS_EFUSE_INTR_SOURCE));

    qdev_realize(DEVICE(&s->sens), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device(sys_mem, &s->sens, DR_REG_SENS_BASE);

    qdev_realize(DEVICE(&s->ana), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device(sys_mem, &s->ana, DR_REG_ANA_BASE);

    qdev_realize(DEVICE(&s->fe), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device(sys_mem, &s->fe, DR_REG_FE_BASE);

    qdev_realize(DEVICE(&s->phya), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device(sys_mem, &s->phya, DR_REG_PHYA_BASE);

    qdev_realize(DEVICE(&s->flash_enc), &s->periph_bus, &error_abort);
    esp32_soc_add_periph_device(sys_mem, &s->flash_enc, DR_REG_SPI_ENCRYPT_BASE);

    qdev_connect_gpio_out_named(DEVICE(&s->efuse), ESP32_EFUSE_UPDATE_GPIO, 0,
                                qdev_get_gpio_in_named(DEVICE(&s->flash_enc), ESP32_FLASH_ENCRYPTION_EFUSE_UPDATE_GPIO, 0));
    qdev_connect_gpio_out_named(DEVICE(&s->dport), ESP32_DPORT_FLASH_ENC_EN_GPIO, 0,
                                qdev_get_gpio_in_named(DEVICE(&s->flash_enc), ESP32_FLASH_ENCRYPTION_ENC_EN_GPIO, 0));
    qdev_connect_gpio_out_named(DEVICE(&s->dport), ESP32_DPORT_FLASH_DEC_EN_GPIO, 0,
                                qdev_get_gpio_in_named(DEVICE(&s->flash_enc), ESP32_FLASH_ENCRYPTION_DEC_EN_GPIO, 0));

    qdev_realize(DEVICE(&s->sdmmc), &s->periph_bus, &error_abort);
    esp32_soc_add_periph_device(sys_mem, &s->sdmmc, DR_REG_SDMMC_BASE);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->sdmmc), 0,
                       qdev_get_gpio_in(intmatrix_dev, ETS_SDIO_HOST_INTR_SOURCE));

    esp32_soc_add_unimp_device(sys_mem, "esp32.rtcio", DR_REG_RTCIO_BASE, 0x400,0);
    esp32_soc_add_unimp_device(sys_mem, "esp32.iomux", DR_REG_IO_MUX_BASE, 0x2000,0);
    esp32_soc_add_unimp_device(sys_mem, "esp32.hinf", DR_REG_HINF_BASE, 0x1000,0);
    esp32_soc_add_unimp_device(sys_mem, "esp32.slc", DR_REG_SLC_BASE, 0x1000,0);
    esp32_soc_add_unimp_device(sys_mem, "esp32.slchost", DR_REG_SLCHOST_BASE, 0x1000,0);
    esp32_soc_add_unimp_device(sys_mem, "esp32.apbctrl", DR_REG_APB_CTRL_BASE, 0x1000,0);
    esp32_soc_add_unimp_device(sys_mem, "esp32.i2s0", DR_REG_I2S_BASE, 0x1000,0);
    esp32_soc_add_unimp_device(sys_mem, "esp32.i2s1", DR_REG_I2S1_BASE, 0x1000,0);
    esp32_soc_add_unimp_device(sys_mem, "esp32.fe2", DR_REG_FE2_BASE, 0x1000, -1);
    esp32_soc_add_unimp_device(sys_mem, "esp32.chipv7_phy", DR_REG_PHY_BASE, 0x1000,-1);
    esp32_soc_add_unimp_device(sys_mem, "esp32.chipv7_phyb", DR_REG_WDEV_BASE, 0x1000,0);
    esp32_soc_add_unimp_device(sys_mem, "esp32.unknown_wifi", DR_REG_NRX_BASE  , 0x1000,-1);
    esp32_soc_add_unimp_device(sys_mem, "esp32.unknown_wifi1", DR_REG_BB_BASE , 0x1000,-1);

    /* st7789v is attached to SPI2 and SPI2 so the both HSPI and VSPI will work, 
    they share a single console*/
    DeviceState *disp=ssi_create_peripheral(s->spi[2].spi, "st7789v");
    DeviceState *disp1=ssi_create_peripheral(s->spi[3].spi, "st7789v");
    ssi_create_peripheral(s->rmt.rmt, "rgbled");
    //printf("%p\n",disp3);
    qemu_irq cmd_irq=qemu_irq_split(
                qdev_get_gpio_in_named(disp, "cmd", 0),
                qdev_get_gpio_in_named(disp1, "cmd", 0));
    qemu_irq bl_irq=qemu_irq_split(
                qdev_get_gpio_in_named(disp, "backlight", 0),
                qdev_get_gpio_in_named(disp1, "backlight", 0));
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 16, cmd_irq);
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 4,bl_irq);

    qemu_irq in0=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 0);
    qemu_irq in35=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 35);
    qdev_connect_gpio_out_named(disp, "buttons", 0, in0);
    qdev_connect_gpio_out_named(disp, "buttons", 1, in35);
    qdev_connect_gpio_out_named(disp1, "buttons", 0, in0);
    qdev_connect_gpio_out_named(disp1, "buttons", 1, in35);

    /* Emulation of APB_CTRL_DATE_REG, needed for ECO3 revision detection.
     * This is a small hack to avoid creating a whole new device just to emulate one
     * register.
     */
    const hwaddr apb_ctrl_date_reg = DR_REG_APB_CTRL_BASE + 0x7c;
    MemoryRegion *apbctrl_mem = g_new(MemoryRegion, 1);
    memory_region_init_ram(apbctrl_mem, NULL, "esp32.apbctrl_date_reg", 4 /* bytes */, &error_fatal);
    memory_region_add_subregion(sys_mem, apb_ctrl_date_reg, apbctrl_mem);
    uint32_t apb_ctrl_date_reg_val = 0x16042000 | 0x80000000;  /* MSB indicates ECO3 silicon revision */
    cpu_physical_memory_write(apb_ctrl_date_reg, &apb_ctrl_date_reg_val, 4);

    qemu_register_reset((QEMUResetHandler*) esp32_soc_reset, dev);

//PICSimLab gpio map

//ESP32-DevKitC V4
    pout_irq = qemu_allocate_irqs (pout_irq_handler, NULL, 38);
//1-3V3 
//2-EN
//3-GPIO36
    pin_irq[3]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 36);
//4-GPIO39
    pin_irq[4]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 39);
//5-GPIO34
    pin_irq[5]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 34);
//6-GPIO35
    pin_irq[6]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 35);
//7-GPIO32
    pin_irq[7]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 32);
//8-GPIO33
    pin_irq[8]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 33);
//9-GPIO25
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 25, pout_irq[9]);
    pin_irq[9]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 25);
//10-GPIO26
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 26, pout_irq[10]);
    pin_irq[10]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 26);
//11-GPIO27
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 27, pout_irq[11]);
    pin_irq[11]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 27);
//12-GPIO14
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 14, pout_irq[12]);
    pin_irq[12]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 14);
//13-GPIO12
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 12, pout_irq[13]);
    pin_irq[13]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 12);
//14-GND
//15-GPIO13
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 13, pout_irq[15]);
    pin_irq[15]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 13);
//16-GPIO9
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 9, pout_irq[16]);
    pin_irq[16]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 9);
//17-GPIO10
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 10, pout_irq[17]);
    pin_irq[17]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 10);
//18-GPIO11
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 11, pout_irq[18]);
    pin_irq[18]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 11);
//19-VIN

