ABigBright/qemu_stm32_1/hw/xtensa/esp32_picsimlab.c
//20-GPIO6
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 6, pout_irq[20]);
    pin_irq[20]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 6);
//21-GPIO7
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 7, pout_irq[21]);
    pin_irq[21]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 7);
//22-GPIO8
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 8, pout_irq[22]);
    pin_irq[22]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 8);
//23-GPIO15
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 15, pout_irq[23]);
    pin_irq[23]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 15);
//24-GPIO2
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 2, pout_irq[24]);
    pin_irq[24]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 2);
//25-GPIO0
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 0, pout_irq[25]);
    pin_irq[25]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 0);
//26-GPIO4
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 4, pout_irq[26]);
    pin_irq[26]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 4);
//27-GPIO16
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 16, pout_irq[27]);
    pin_irq[27]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 16);
//28-GPIO17
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 17, pout_irq[28]);
    pin_irq[28]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 17);
//29-GPIO5
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 15, pout_irq[29]);
    pin_irq[29]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 15);
//30-GPIO18
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 18, pout_irq[30]);
    pin_irq[30]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 18);
//31-GPIO19
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 19, pout_irq[31]);
    pin_irq[31]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 19);
//32-GND
//33-GPIO21
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 21, pout_irq[33]);
    pin_irq[33]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 21);
//34-GPIO3
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 3, pout_irq[34]);
    pin_irq[34]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 3);
//35-GPIO1
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 1, pout_irq[35]);
    pin_irq[35]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 1);
//36-GPIO22
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 22, pout_irq[36]);
    pin_irq[36]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 22);
//37-GPIO23
    qdev_connect_gpio_out_named(DEVICE(&s->gpio), ESP32_GPIOS, 23, pout_irq[37]);
    pin_irq[37]=qdev_get_gpio_in_named(DEVICE(&s->gpio), ESP32_GPIOS_IN, 23);
//38-GND
}

static void esp32_soc_init(Object *obj)
{
    Esp32SocState *s = ESP32_SOC(obj);
    global_s = s;
    
    MachineState *ms = MACHINE(qdev_get_machine());
    char name[16];

    MemoryRegion *system_memory = get_system_memory();

    qbus_init(&s->periph_bus, sizeof(s->periph_bus),
                        TYPE_SYSTEM_BUS, DEVICE(s), "esp32-periph-bus");
    qbus_init(&s->rtc_bus, sizeof(s->rtc_bus),
                        TYPE_SYSTEM_BUS, DEVICE(s), "esp32-rtc-bus");

    for (int i = 0; i < ms->smp.cpus; ++i) {
        snprintf(name, sizeof(name), "cpu%d", i);
        object_initialize_child(obj, name, &s->cpu[i], TYPE_ESP32_CPU);

        const uint32_t cpuid[ESP32_CPU_COUNT] = { 0xcdcd, 0xabab };
        s->cpu[i].env.sregs[PRID] = cpuid[i];

        snprintf(name, sizeof(name), "cpu%d-mem", i);
        memory_region_init(&s->cpu_specific_mem[i], NULL, name, UINT32_MAX);

        CPUState* cs = CPU(&s->cpu[i]);
        cs->num_ases = 1;
        cpu_address_space_init(cs, 0, "cpu-memory", &s->cpu_specific_mem[i]);

        MemoryRegion *cpu_view_sysmem = g_new(MemoryRegion, 1);
        snprintf(name, sizeof(name), "cpu%d-sysmem", i);
        memory_region_init_alias(cpu_view_sysmem, NULL, name, system_memory, 0, UINT32_MAX);
        memory_region_add_subregion_overlap(&s->cpu_specific_mem[i], 0, cpu_view_sysmem, 0);
        cs->memory = &s->cpu_specific_mem[i];
    }

    for (int i = 0; i < ESP32_UART_COUNT; ++i) {
        snprintf(name, sizeof(name), "uart%d", i);
        object_initialize_child(obj, name, &s->uart[i], TYPE_ESP32_UART);
    }

    object_property_add_alias(obj, "serial0", OBJECT(&s->uart[0]), "chardev");
    object_property_add_alias(obj, "serial1", OBJECT(&s->uart[1]), "chardev");
    object_property_add_alias(obj, "serial2", OBJECT(&s->uart[2]), "chardev");

    object_initialize_child(obj, "gpio", &s->gpio, TYPE_ESP32_GPIO);

    object_initialize_child(obj, "dport", &s->dport, TYPE_ESP32_DPORT);

    object_initialize_child(obj, "intmatrix", &s->intmatrix, TYPE_ESP32_INTMATRIX);

    object_initialize_child(obj, "crosscore_int", &s->crosscore_int, TYPE_ESP32_CROSSCORE_INT);

    object_initialize_child(obj, "rtc_cntl", &s->rtc_cntl, TYPE_ESP32_RTC_CNTL);

    for (int i = 0; i < ESP32_FRC_COUNT; ++i) {
        snprintf(name, sizeof(name), "frc%d", i);
        object_initialize_child(obj, name, &s->frc_timer[i], TYPE_ESP32_FRC_TIMER);
    }

    for (int i = 0; i < ESP32_TIMG_COUNT; ++i) {
        snprintf(name, sizeof(name), "timg%d", i);
        object_initialize_child(obj, name, &s->timg[i], TYPE_ESP32_TIMG);
    }
    for (int i = 0; i < ESP32_SPI_COUNT; ++i) {
        snprintf(name, sizeof(name), "spi%d", i);
        object_initialize_child(obj, name, &s->spi[i], TYPE_ESP32_SPI);
    }

    for (int i = 0; i < ESP32_I2C_COUNT; ++i) {
        snprintf(name, sizeof(name), "i2c%d", i);
        object_initialize_child(obj, name, &s->i2c[i], TYPE_ESP32_I2C);
    }

    object_initialize_child(obj, "rng", &s->rng, TYPE_ESP32_RNG);

    object_initialize_child(obj, "sha", &s->sha, TYPE_ESP32_SHA);

    object_initialize_child(obj, "rsa", &s->rsa, TYPE_ESP32_RSA);

    object_initialize_child(obj, "sens", &s->sens, TYPE_ESP32_SENS);

    object_initialize_child(obj, "ana", &s->ana, TYPE_ESP32_ANA);

